import {atom} from 'recoil';
const st_agree1 = `이용약관

제 1 장 총칙

제1조(개인정보의 처리 목적) 

본 약관은 ㈜애가인(이하 '회사'라 함)가 운영하는 모바일 어플리케이션(이하 ‘A-플래너’이라 함)에서 제공하는 재반 서비스의 이용과 관련하여 회사와 이용자 및 이용자 간의 권리, 의무 및 책임사항 기타 필요한 사항을 규정함을 목적으로 합니다.

제 2조 약관의 명시, 효력 및 변경
① 회사는 본 약관의 내용을 이용자가 쉽게 접근할 수 있도록 A-플래너 모바일 어플리케이션에 공지합니다.
② 회사는 필요한 경우 관련 법령을 위배하지 않는 범위 내에서 본 약관을 변경할 수 있습니다. 본 약관이 변경되는 경우 회사는 변경 사항을 시행 일자 7일 전부터 이용자에게 공지 또는 통지하는 것을 원칙으로 하며, 이용자에게 불리한 내용으로 변경할 경우에는 그 시행 일자 15일 전부터 이동전화 메시지 서비스(SMS, MMS), 알림 메시지를 띄우는 등 합리적으로 가능 한 방법으로 변경사항을 공지 또는 통지합니다.
③ 회사가 전 항에 따라 공지 또는 통지를 하면서 공지 또는 통지일로부터 개정약관 시행일 5일 후까지 거부 의사를 표시하지 아니하면 승인한 것으로 본다는 뜻을 명확하게 알렸음에도 이용자의 의사표시가 없는 경우에는 변경된 약관을 승인한 것으로 봅니다. 개정약관에 동의하지 않을 경우 제8조 제1항에 따라 이용계약을 해지할 수 있습니다.

제 3조 약관 외 준칙
본 약관에서 규정되지 않은 사항에 대해서는 관련 법령 또는 회사가 정한 서비스의 이용약관, 운영정책 및 규칙 등(이하 ‘세부지침’)의 규정을 따릅니다. 또한, 본 약관과 세부지침의 내용이 충돌할 경우 세부지침에 따릅니다.

제 4조 서비스의 중단
① 회사는 컴퓨터 등 정보통신설비의 보수점검, 교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다.
② 사업 종목의 전환, 사업의 포기, 업체 간의 통합 등의 이유로 서비스를 제공할 수 없게 되는 경우에는 회사는 이용자에게 통지하거나, 이용자가 알아볼 수 있도록 별도의 공지사항으로 게시합니다.

제 5조 이용자에 대한 통지
① 회사는 이동전화 단문메시지서비스(SMS), 어플리케이션 푸시알림(App push) 등으로 이용자에게 통지할 수 있습니다.
② 회사는 불특정다수 이용자에 대한 통지의 경우 공지사항으로 게시함으로써 개별 통지를 갈음할 수 있습니다.

제 2 장 이용계약 및 정보 보호

제 1 조 회원가입 및 회원정보의 변경
① 이용자는 회사가 정한 가입 양식에 따라 회원정보를 기재한 후 본 약관 및 개인정보취급방침 등에 동의한다는 의사표시를 함으로써 회원가입을 신청합니다.
② 회원가입 계약의 성립 시기는 회사의 승낙이 이용자에게 도달한 시점으로 합니다.
③ 회원은 회원가입 신청 시 기재한 사항이 변경되었을 경우 온라인(A-플러스 어플리케이션)으로 수정을 하거나 전자우편 및 기타 방법으로 회사에 그 변경사항을 알려야 합니다.
④ 제3항의 변경사항을 회사에 알리지 않아 발생한 불이익에 대하여 회사는 책임지지 않습니다.
⑤ 회원가입은 반드시 본인의 진정한 정보를 통해서만 가입할 수 있으며 회사는 이용자가 등록한 정보에 대하여 확인조치를 할 수 있습니다. 이용자는 회사의 확인조치에 대하여 적극적으로 협력하여야 하며, 만일 이를 준수하지 아니할 경우 회사는 이용자가 등록한 정보가 부정한 것으로 처리할 수 있습니다.
⑥ 회사는 회원을 등급별로 구분하여 이용에 차등을 둘 수 있습니다.

제 2 조 서비스의 이용, 변경 및 종료
① 회사는 서비스를 365일, 24시간 쉬지 않고 제공하기 위하여 최선을 다합니다. 다만, 장비의 유지ㆍ보수를 위한 정기, 임시 점검 또는 다른 상당한 이유로 서비스의 제공이 일시 중단 될 수 있으며, 이때에는 미리 서비스 제공화면에 공지합니다. 만약, 회사로서도 예측할 수 없는 이유로 서비스가 중단된 때에는 회사가 상황을 파악하는 즉시 최대한 빠른 시일 내에 서비스를 복구하도록 노력합니다.
② 회사는 서비스 제공을 위해 계약한 각 건설사와의 계약 종료 및 변경, 신규서비스 개시 등의 사유로 서비스의 내용이 변경되거나, 서비스가 종료될 수 있습니다. 

제 3 조 이용계약 해지
① 이용자는 서비스의 이용을 더 이상 원치 않을 때는 언제든지 A-플래너 서비스 내 제공되는 회원탈퇴 메뉴를 이용하여 서비스 이용계약의 해지 신청을 할 수 있으며, 회사는 이를 즉시 처리합니다.
② 이용계약이 해지된 경우라도 이용자는 다시 회사에 대하여 이용계약의 체결을 신청할 수있습니다.

제 4 조 개인정보보호
① 회사는 이용자의 회원가입 시 서비스 제공에 필요한 최소한의 정보(아이디, 패스워드, 성명, 휴대폰 번호, 주소)를 수집합니다.
② 제공된 이용자의 개인정보는 이용자의 동의 없이 목적 외의 이용이나 제3자에게 제공하지않습니다. 다만, 다음의 경우에는 예외로 합니다.
1) 도용방지를 위하여 본인확인에 필요한 경우
2) 법률의 규정 또는 법률에 따라 제공에 불가피한 사유가 있는 경우
3) 회사가 제1항과 제2항에 의해 이용자의 동의를 받아야 하는 경우에는 개인정보취급방침에 알린 개인정보관리 책임자의 신원(성명 및 전화번호 등), 정보의 수집목적 및 이용목적, 제3자에 대한 정보제공 관련사항(제공받은 자, 제공목적 및 제공할 정보의 내용) 등 [정보통신망 이용촉진 및 정보보호 등에 관한 법률] 제22조 제2항이 규정한 사항을 미리 명시하거나 알리며 이용자는 언제든지 이 동의를 철회할 수 있습니다.
③ 회사는 이용자의 개인정보를 보호하기 위해 '개인정보취급방침'을 수립하고 개인정보보호 책임자를 지정합니다.
④ 모든 이용자는 자신의 개인정보를 책임있게 관리하여 타인이 이용자의 개인정보를 부정하게 이용할 수 없도록 해야 합니다.

제 5 조 책임의 한계
① 회사는 무료로 제공하는 정보 및 서비스에 관하여 “개인정보취급방침” 또는 관계 법령의벌칙, 과태료 규정 등 강행규정에 위배되지 않는 한 원칙적으로 손해를 배상할 책임이 없습니다.
② 회사는 천재지변, 불가항력, 서비스용 설비의 보수, 교체, 점검 및 이에 준하는 사항으로서비스를 제공할 수 없는 경우에 이에 대한 책임이 면제됩니다.
③ 회사는 이용자의 귀책사유로 인한 정보 및 서비스 이용의 장애에 관하여는 책임을 지지 않습니다.

제 6 조 손해배상 등
회사는 회사의 과실로 인하여 이용자가 손해를 입게 될 경우 본 약관 및 법령에 따라 이용자의 손해를 배상합니다. 다만 회사는 아래와 같은 손해에 대해서는 책임을 부담하지 않습니다. 또한 회사는 법률상 허용되는 한도 내에서 간접 손해, 특별 손해, 결과적 손해, 징계적 손해 및 징벌적 손해에 대한 책임을 부담하지 않습니다.
1) 천재지변 또는 이에 준하는 불가항력의 상태에서 발생한 손해
2) 이용자의 귀책사유로 서비스 이용에 장애가 발생한 경우
3) 제3자가 불법적으로 회사의 서버에 접속하거나 서버를 이용함으로써 발생하는 손해
4) 제3자가 악성 프로그램을 전송 또는 유포함으로써 발생하는 손해
5) 전송된 데이터의 생략, 누락, 파괴 등으로 발생한 손해, 명예훼손 등 제3자가 서비스를 이용하는 과정에서 발생된 손해
6) 기타 회사의 고의 또는 과실이 없는 사유로 인해 발생한 손해

제 7 조 분쟁의 해결
본 약관 또는 서비스는 대한민국법령에 의하여 규정되고 이행됩니다. 서비스 이용과 관련하여 회사와 이용자 간에 분쟁이 발생하면 이의 해결을 위해 회사는 성실히 협의 할 것입니다.
그럼에도 불구하고 해결되지 않으면 민사소송법의 관할법원에 소를 제기할 수 있습니다

제 8 조 (개인정보 보호책임자) 
① 회사는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.


▶ 개인정보 보호책임자
성명 :장미옥
직책 :대표
연락처 :02-521-1541, 이메일 :  jmj5588@hanmail.net, 팩스 : 02-522-1541
※ 개인정보 보호 담당부서로 연결됩니다.
② 정보주체께서는 A-플래너 의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. 회사의 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.

제9 조(권익침해 구제방법)
정보주체는 개인정보침해로 인한 구제를 받기 위하여 개인정보분쟁조정위원회, 한국인터넷진흥원 개인정보침해신고센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의 신고, 상담에 대하여는 아래의 기관에 문의하시기 바랍니다.
1. 개인정보분쟁조정위원회 : (국번없이) 1833-6972 (www.kopico.go.kr)
2. 개인정보침해신고센터 : (국번없이) 118 (privacy.kisa.or.kr)
3. 대검찰청 : (국번없이) 1301 (www.spo.go.kr)
4. 경찰청 : (국번없이) 182 (cyberbureau.police.go.kr)
「개인정보보호법」제35조(개인정보의 열람), 제36조(개인정보의 정정·삭제), 제37조(개인정보의 처리정지 등)의 규정에 의한 요구에 대 하여 공공기관의 장이 행한 처분 또는 부작위로 인하여 권리 또는 이익의 침해를 받은 자는 행정심판법이 정하는 바에 따라 행정심판을 청구할 수 
있습니다.
※ 행정심판에 대해 자세한 사항은 중앙행정심판위원회(www.simpan.go.kr) 홈페이지를 참고하시기 바랍니다.`


const st_agree2 =`<  (주)애가인 >(A-플래너)는(은) 「개인정보 보호법」 제30조에 따라 정부주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고  원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리방침을 수립·공개합니다.

○ 이  개인정보처리방침은 2021년 11월 20부터 적용됩니다.

㈜애가인(이하‘회사’)는 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 개인정보보호법, 통신비밀보호법, 전기통신사업법 등 정보통신서비스제공자가  준수하여야 할 관련 법령상 의 
개인정보보호 규정을 준수하며, 관련 법령에 따른 개인정보취급방침을 정하여 여러분의 권익 보호에 최선을 다하고 있습니다. 

개인정보취급방침 내용 추가, 삭제 및 수정이 있을 시에는 개정 최소 7일 전부터 서비스 내의 ‘공지사항’ 또는 기타 알기쉬운  방법을 통해 공유 드릴 예정입니다. 그 밖에 개인정보의 수집및 활용, 제3자 제공 등과 같이 이용자 권리의 중요한 변경이 있으면 최소  15일 전에 알려드리겠습니다.

수집하는 개인정보는 다음과 같습니다.
회사는 회원가입(또는 서비스가입), 원활한 고객 상담, 각종 서비스의 제공을 위해A-플래너 서비스 최초이용 시 필요한 개인정보를 수집하고 있습니다. 필수적으로 취합되는정보에는이름,휴대전화번호,가입시비밀번호,단말기정보등이 있습니다. 또한,A-플래너에 특화된 여러 기능을 사용하기위해서 등록하게 되는 이메일정보가 선택적으로 수집될 수 있습니다. 그밖에도 서비스 이용과정이나 사업처리과정에서 위치정보, 접속IP정보, 방문일시, 서비스 이용기록, 제재 및 이용정지기록 등이 생성되어 수집될 수 있습니다.

개인정보의 제공
회사는 회원의 개인정보를 개인정보의 수집 및 이용목적에 고지한 범위 내에서만 사용합니다.
서비스 이용 중 사용자식별을 위하여 가입시기재한주소(지역에 한정)가 이용자 간에 공개 됩니다.회사는 서비스 이용과정 등에서 개인정보제공을 사전에 동의하는 경우나 법령에 규정된 경우를 제외하고는 회원의 개인정보를 절대 제3자에게 제공하거나 공유하지 않습니다.

수집된 개인정보의 파기
회원의 개인정보는 원칙적으로 계정 삭제시 또는 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다. 다만, 관계법령의 규정에 의하여 보존할 필요가 있는 경우에는 관계법령에서 정한 일정한 기간 회원정보를 보관합니다.
수집 및 이용 목적이 달성된 개인정보는 별도의DB로 옮겨져(종이의 경우 별도의 서류함)내부방침 및 기타관련법령에 의한 정보보호사유에 따라(개인정보보유 및 이용기간참조)일정기간 저장된 후 파기됩니다. 이때 해당하는 개인정보는 법률에 의한 경우가 아니고서는 보유되는 이외의 다른 목적으로 이용되지 않습니다. 수집된 정보 파기 시, 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기하고 있으며 전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.

웹서비스제공을 위한 쿠키사용
회사는 개인화되고 맞춤화된 서비스를 제공하기위해서 회원의 개인정보를 저장하고 불러오는
‘쿠키(cookie)’를 사용 합니다. 이 정보는 회원의 디바이스에 저장되며, 회사는 이를 이용하여
회원의 방문기록, 이용형태를 통해서 최적화된 서비스를 제공하기위하여 활용합니다.
쿠키는 개인을 식별하는 정보를 자동적. 능동적으로 수집하지 않으며, 회원은 이러한 쿠키의 
저장을 웹브라우저의 설정을 변경하여 거부하거나 삭제할 수 있습니다. 다만 쿠키의 저장을 거부할 경우에는 일부서비스 제공에 어려움을 줄 수 있습니다.

회사는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리  및  피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.

▶ 개인정보  보호책임자
성명 :장미옥
직책 :대표
연락처:02-521-1541, 이메일:jmj5588@hanmail.net, 팩스 : 02-522-1541

정보주체께서는 회사의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보  보호책임자 및 담당부서로 문의하실 수 있습니다. 회사는 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.

권익침해  구제방법
정보주체는 개인정보침해로 인한 구제를 받기 위하여 개인정보 분쟁조정위원회,
한국인터넷진흥원, 개인정보침해신고센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의 신고, 상담에 대하여는 아래의 기관에 문의하시기 바랍니다.
1.  개인정보 분쟁조정위원회 : (국번없이) 1833-6972 (www.kopico.go.kr)
2.  개인정보침해신고센터 : (국번없이) 118 (privacy.kisa.or.kr)
3. 대검찰청  : (국번없이) 1301 (www.spo.go.kr)
4. 경찰청 :  (국번없이) 182 (cyberbureau.police.go.kr)
「개인정보보호법」제35조(개인정보의  열람), 제36조(개인정보의 정정·삭제), 제37조(개인정보의 처리정지 등)의  규정에 의한 요구에 대 하여 공공기관의 장이 행한 처분 또는  부작위로
 인하여 권리 또는 이익의 침해를 받은 자는 행정심판법이 정하는 바에 따라 행정심판을 청구할 수 있습니다.
※ 행정심판에  대해 자세한 사항은 중앙행정심판위원회(www.simpan.go.kr) 홈페이지를 참고하시기 바랍니다.`
export const Facility = atom({
  key: 'Facility',
  default: {
    terms:{
      st_agree1:st_agree1,
      st_agree2:st_agree2
    }
  },
});



// {
//     "result": "true",
//     "msg": "요청하신 정보입니다.",
//     "data": {
//         "idx": "1",
//         "ft_name": "test",
//         "ft_location": "test",
//         "ft_size": "test",
//         "ft_addr": "test",
//         "ft_order": "test",
//         "ft_event_sdate": "2021-10-22",
//         "ft_event_edate": "2021-11-05",
//         "ft_complete": "test",
//         "ft_check_sdate": "2021-11-08",
//         "ft_check_edate": "2021-11-25",
//         "ft_check_stime": "09:00",
//         "ft_check_etime": "18:00",
//         "ft_check_term": "60",
//         "ft_max_household": "6",
//         "ft_check_guide": "테스트",
//         "ft_res_sdate": "2021-11-04",
//         "ft_res_edate": "2021-12-25",
//         "ft_res_guide": "테스트",
//         "ft_res_household": "",
//         "ft_res_stime": "",
//         "ft_wdate": "2021-10-27",
//         "ft_image1": "20211022170609_ft_image__1.png",
//         "ft_image2": "20211022170633_ft_image__2.png",
//         "ft_image3": "",
//         "ft_idx": "1"
//     }
// }
